In [2]:
import pandas as pd

3.1 Warm Up Exercises:
1. Sorting and Subsetting:

In [7]:
df=pd.read_csv("/content/drive/MyDrive/Titanic-Dataset.csv")
dataframe= pd.DataFrame(df)
df.info()
df.head(1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

Problem 1 - Sorting:

In [11]:
#1Create a DataFrame called fare that contains only the Fare column of the Titanic dataset. Print the
#head of the result.
fare_only= dataframe[["Fare"]]
fare_only.head()

#2Create a DataFrame called class age that contains only the Pclass and Age columns of the Titanic
#dataset, in that order. Print the head of the result.
class_age = df[['Pclass', 'Age']]
print(class_age.head())

#3. Create a DataFrame called survived gender that contains the Survived and Sex columns of the
#Titanic dataset, in that order.Print the head of the result.
survived_gender = df[['Survived', 'Sex']]
print(survived_gender.head())

   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0
   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

Problem - 2 - Subsetting:

Subsetting Rows:

In [46]:
#1 Filter the Titanic dataset for cases where the passenger’s fare is greater than 100, assigning it
#to fare gt 100.View the printed result.

# fare_gt_100= dataframe[dataframe["Fare"]>100]
# print(fare_gt_100.head(3))

#2Filter the Titanic dataset for cases where the passenger’s class (Pclass) is 1, assigning it to
#first class.View the printed result.
# first_class= dataframe[dataframe["Pclass"]==1]
# print(first_class)


#3 Filter the Titanic dataset for cases where the passenger’s age is less than 18 and the passenger
#is female (Sex is "female"), assigning it to female under 18. View the printed result.
female_under_18= dataframe[(dataframe["Age"]<18) & (dataframe["Sex"]=="female")]
print(female_under_18.head())

    PassengerId  Survived  Pclass                                  Name  \
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22           23         1       3           McGowan, Miss. Anna "Annie"
24           25         0       3         Palsson, Miss. Torborg Danira

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked  fare_per_year
9   female  14.0      1      0   237736  30.0708   NaN        C       2.147914
10  female   4.0      1      1  PP 9549  16.7000    G6        S       4.175000
14  female  14.0      0      0   350406   7.8542   NaN        S       0.561014
22  female  15.0      0      0   330923   8.0292   NaN        Q       0.535280
24  female   8.0      3      1   349909  21.0750   NaN        S       2.634375

Subsetting Rows by Categorical variables:

In [48]:
#1. Filter the Titanic dataset for passengers whose Embarked port is either "C" (Cherbourg) or "S"
#(Southampton#), assigning the result to embarked c or s. View the printed result.

# embarked_c_s= dataframe[(dataframe["Embarked"]=="C") | (dataframe["Embarked"]=="S")]
# print(embarked_c_s.head(4))

#2 2. Filter the Titanic dataset for passengers whose Pclass is in the list [1, 2] (indicating first
#or second class),assigning the result to first second class.View the printed result.

first_second_class= dataframe[dataframe["Pclass"].isin([1,2])]
print(first_second_class.head())

    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
9            10         1       2
11           12         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
9                 Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0

    Parch    Ticket     Fare Cabin Embarked  fare_per_year
1       0  PC 17599  71.2833   C85        C       1.875876
3       0    113803  53.1000  C123        S       1.517143
6       0     17463  51.8625   E46        S       0.960417
9       0    237736  30.0708   NaN        C       2.147914
11      0    113783  26.5500  C103        S       0.457759

3.2 Exploratory Data Analysis Practice Exercise - 1.

In [45]:
#Add a column to the Titanic dataset, fare per year, containing the fare divided by the age of
#the passenger(i.e., Fare/Age).
# median_age = dataframe['Age'].median()
# dataframe['Age'] = dataframe['Age'].fillna(median_age)
# dataframe['fare_per_year']= dataframe['Fare']/dataframe['Age']
# print(dataframe.head(6))

#2. Subset rows where fare per year is higher than 5, assigning this to high fare age.
# high_fare_age= dataframe[dataframe['fare_per_year']>5]
# print(high_fare_age)

#3. Sort high fare age by descending fare per year, assigning this to high fare age srt.
# high_fare_age_srt= dataframe.sort_values(by='fare_per_year',ascending=False)
# print(high_fare_age_srt.head(5))

#4. Select only the Name and fare per year columns of high fare age srt and save the result as result.
result = high_fare_age_srt[["Name", "fare_per_year"]]
print(result.head())

#Allison, Master. Hudson Trevor has had the highest fare paid relative to age

                                Name  fare_per_year
305   Allison, Master. Hudson Trevor     164.728261
297     Allison, Miss. Helen Loraine      75.775000
386  Goodwin, Master. Sidney Leonard      46.900000
164     Panula, Master. Eino Viljami      39.687500
183        Becker, Master. Richard F      39.000000